# Author: Claudio <3261958605@qq.com>
# Created: 2017-04-20 11:55:45
# Commentary:
#+TITLE: 内置Exceptions

** exception *ImportError*
   当模块或模块中不存在属性/方法时抛出。
   #+BEGIN_SRC python :session
     import xyz
     from contextlib import xyz
   #+END_SRC

   #+RESULTS[1de671e6db02b57472dc3ea7dad8b62e4f5d1187]:
   : Traceback (most recent call last):
   :   File "<stdin>", line 1, in <module>
   : ImportError: No module named 'xyz'
   : Traceback (most recent call last):
   :   File "<stdin>", line 1, in <module>
   : ImportError: cannot import name 'xyz'

** exception *NameError*
   当本地或全局变量不存在时抛出。

   #+BEGIN_SRC python :session
     print(nothing)
   #+END_SRC

   #+RESULTS[1bee6bdc31025c427bcc8faa0861d054e7ef5958]:
   : Traceback (most recent call last):
   :   File "<stdin>", line 1, in <module>
   : NameError: name 'nothing' is not defined

** exception *RecursionError*

   #+BEGIN_SRC python :eval never
     import sys

     sys.getrecursionlimit()

     def test():
         test()

     test()
   #+END_SRC

   #+RESULTS[ef190f92a0eae7db4a0fae756f8af5d1710eabc0]:
   #+begin_example
     >>> 1000
     >>> >>> ... ... >>> >>> Traceback (most recent call last):
       File "<stdin>", line 1, in <module>
       File "<stdin>", line 2, in test
       File "<stdin>", line 2, in test
       .......
     RecursionError: maximum recursion depth exceeded
   #+end_example

** exception *SyntaxError*
   当解析器遇到语法错误时抛出。

   #+BEGIN_SRC python :session
     a =
   #+END_SRC

   #+RESULTS[9c0ff12f58058f438841251aaa454b3f54b60c57]:
   : File "<stdin>", line 1
   :     a =
   :       ^
   : SyntaxError: invalid syntax

** exception *TypeError*
   类型不正确时抛出。

   #+BEGIN_SRC python :session
     bytes('abc')
   #+END_SRC

   #+RESULTS[dabe16d72ebe0f25a11acb90aa38b48695e68857]:
   : Traceback (most recent call last):
   :   File "<stdin>", line 1, in <module>
   : TypeError: string argument without an encoding

** exception *ZeroDivisionError*
   当使用0作为被除数，或用0作为模底时抛出。

   #+BEGIN_SRC python :session
     1 / 0
     1 % 0
   #+END_SRC

   #+RESULTS[7b21a29e9b570c5362d43b3b0c444438b40cbe5d]:
   : Traceback (most recent call last):
   :   File "<stdin>", line 1, in <module>
   : ZeroDivisionError: division by zero
   : Traceback (most recent call last):
   :   File "<stdin>", line 1, in <module>
   : ZeroDivisionError: integer division or modulo by zero

